Autodesk.Revit.DB.GBXMLExportOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.GBXMLExportOptions.ExportEnergyModelType
The energy model type from which gbXML will be exported.
Remarks:
Default value is SpatialElement.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.GBXMLExportOptions.#ctor
Constructs a new instance of the options used to export a model in gbXML (green-building) format.
Since:
2015

Autodesk.Revit.DB.GBXMLExportOptions
Green-Building XML Export options. Not used currently. Reserved for future use.
Since:
2015